USE PP_MyBase
go
select s.Номер_сделки'Номер_сделки', s.Покупатель'Покупатель', p.Адрес'Адрес'
	from Сделки s
	Inner Join Поклажедатели p on p.Наименование_фирмы = s.Покупатель
		where  p.Адрес = 'г.Минск'
	for xml RAW('TEACHER'), root('Преподаватели_кафедры_ИСиТ'), elements;
go

-------------------------------------------------------------

go
select s.Номер_сделки, s.Покупатель, p.Адрес
	from Сделки s
	Inner Join Поклажедатели p on p.Наименование_фирмы = s.Покупатель
		where  p.Адрес = 'г.Минск'
	for xml AUTO, 
	root('Преподаватели_кафедры_ИСиТ'), 
	elements;
go

------------------------------------------------------------

begin tran
declare @h int = 0,
      @xml varchar(2000) = '<?xml version="1.0" encoding="windows-1251" ?>
							<Поклажедатели> 
								<Поклажедатель Наименование_фирмы="Фирма4" Адрес="г.Белоозёрск" Телефон="9191454" /> 
								<Поклажедатель Наименование_фирмы="Фирма5" Адрес="г.Брест" Телефон="9988999" /> 
							</Поклажедатели>'

exec sp_xml_preparedocument @h output, @xml;
select * from openxml(@h, '/Поклажедатели/Поклажедатель', 0)
	with(Наименование_фирмы char(50), Адрес varchar(50), Телефон char(20))    

print @h
print 'дескриптор процедур'

insert into Поклажедатели select * from openxml(@h, '/Поклажедатели/Поклажедатель', 0)
	with(Наименование_фирмы char(50), Адрес varchar(50), Телефон char(20))    

select * from Поклажедатели where Наименование_фирмы LIKE 'Фирма%'

exec sp_xml_removedocument @h          

rollback 

select * from Поклажедатели