
/* заполнение таблиц */

INSERT INTO Товары (Наименование, Цена, Количество)
	Values ('Стол', 25.5, 4),
		   ('Стул', 15, 4),
		   ('Полка', 20.0, 10);

INSERT into Заказчики
	Values ('Белвест', 'Кальварийская, 25', '123123123'),
		   ('Zte', 'Минская, 13', '321321'),
		   ('VVS', 'Белорусская, 21', '13062003');

Insert into Заказы
	values (10, 'Полка', 20.0, 1, '2014-5-7', 'Белвест'),
		   (11, 'Стул', 15, 3, '2014-5-8', 'Zte'),
		   (12, 'Стол', 25.5, 4, '2014-5-9', 'VVS');



		   
		     